---
title: "**[DV2023]** 05wk-2: Pandas – transform column (꿀팁)"
author: "JiyunLim"
date: "10/04/2023"
categories:
  - Pandas
---

# 1. 강의영상

<https://youtu.be/playlist?list=PLQqh36zP38-wVp_fe2YXiERTc0ZEh9Li_&si=rr31LPWCeN_negav>

# 2. Imports

In [12]:
import pandas as pd
import numpy as np

# 3. Pandas: transform column (꿀팁)

## A. `lambda`

저번시간에 했음

## B. `map`

저번시간에 했음

## C. `s.apply(변환함수)`

- 변환함수: 스칼라 $\to$ 스칼라 // 벡터 $\to$ 벡터 // 매트릭스 $\to$ 매트릭스 (예: x$\to x+1$: [1,2] $\to$ [2,3])
- 집계함수: 벡터 $\to$ 스칼라 (예: 평균 [1,2,3,4] $\to$ 2.5)

`-` 예시1: 원소별로 처음3개의 숫자만 출력

In [3]:
df = pd.read_csv('https://raw.githubusercontent.com/guebin/DV2022/master/posts/FIFA23_official_data.csv')
s = df.Height # pandas series

In [4]:
s

0        189cm
1        179cm
2        172cm
3        181cm
4        172cm
         ...
17655    190cm
17656    195cm
17657    190cm
17658    187cm
17659    186cm
Name: Height, Length: 17660, dtype: object

In [18]:
s.apply(lambda x: x[:3])

0        189
1        179
2        172
3        181
4        172
        ...
17655    190
17656    195
17657    190
17658    187
17659    186
Name: Height, Length: 17660, dtype: object

- 숫자가 아닌 오브젝트형!

In [16]:
s_ = pd.Series([1,2,3])
s_.apply(lambda x: np.mean(x)) # 우리가 원하는 [1,2,3]의 평균인 2가 나오지 않음!

0    1.0
1    2.0
2    3.0
dtype: float64

 ::: {.callout-note}
 
series의 apply함수에 집계함수를 쓰면 우리가 생각하는 대로 동작하지 않는다.
 (후에 데이터프레임과 혼용하여 쓸 때 헷갈림 주의)
:::

`-` 예시2: 원소별로 처음3개의 문자만 출력 $\to$ `str`자료형을
`int`자료형으로 변환

In [19]:
df = pd.read_csv('https://raw.githubusercontent.com/guebin/DV2022/master/posts/FIFA23_official_data.csv')
s = df.Height

(방법1) – 한번에

In [21]:
s.apply(lambda x: int(x[:3])) # 타입이 int로 잘 바뀜

0        189
1        179
2        172
3        181
4        172
        ...
17655    190
17656    195
17657    190
17658    187
17659    186
Name: Height, Length: 17660, dtype: int64

(방법2) – 연쇄적으로..

In [106]:
s.apply(lambda x: x[:3]).apply(int)

## D. `s.str`, `idx.str`

`-` 예시1: 원소별로 처음 3개의 숫자만 출력

In [107]:
df = pd.read_csv('https://raw.githubusercontent.com/guebin/DV2022/master/posts/FIFA23_official_data.csv')
s = df.Height

In [24]:
'190cm'[:3] # 브로드 캐스팅이 됐으면 좋을 것 같은데?

'190'

In [25]:
s.str

In [23]:
s.str[:3] # 문자열들의 수열버전

0        189
1        179
2        172
3        181
4        172
        ...
17655    190
17656    195
17657    190
17658    187
17659    186
Name: Height, Length: 17660, dtype: object

In [26]:
s.str.replace('cm','') #  이것도 이제 잘됨.

0        189
1        179
2        172
3        181
4        172
        ...
17655    190
17656    195
17657    190
17658    187
17659    186
Name: Height, Length: 17660, dtype: object

`-` 예시2: 원소별로 isupper를 수행

In [27]:
s = pd.Series(['A','B','C','d','e','F'])
s

0    A
1    B
2    C
3    d
4    e
5    F
dtype: object

In [28]:
s.isupper() # 이렇게 하면 오류남!

AttributeError: 'Series' object has no attribute 'isupper'

In [29]:
s.str.isupper()

0     True
1     True
2     True
3    False
4    False
5     True
dtype: bool

`-` 예시3: 원소별로 공백제거 (pd.Series 뿐만 아니라 pd.Index 자료형에도
사용가능)

In [30]:
df = pd.read_csv('https://raw.githubusercontent.com/guebin/DV2022/master/posts/FIFA23_official_data.csv')
idx = df.columns

In [31]:
idx

Index(['ID', 'Name', 'Age', 'Photo', 'Nationality', 'Flag', 'Overall',
       'Potential', 'Club', 'Club Logo', 'Value', 'Wage', 'Special',
       'Preferred Foot', 'International Reputation', 'Weak Foot',
       'Skill Moves', 'Work Rate', 'Body Type', 'Real Face', 'Position',
       'Joined', 'Loaned From', 'Contract Valid Until', 'Height', 'Weight',
       'Release Clause', 'Kit Number', 'Best Overall Rating'],
      dtype='object')

In [32]:
# 공백삭제
idx.str.replace(' ', '')

Index(['ID', 'Name', 'Age', 'Photo', 'Nationality', 'Flag', 'Overall',
       'Potential', 'Club', 'ClubLogo', 'Value', 'Wage', 'Special',
       'PreferredFoot', 'InternationalReputation', 'WeakFoot', 'SkillMoves',
       'WorkRate', 'BodyType', 'RealFace', 'Position', 'Joined', 'LoanedFrom',
       'ContractValidUntil', 'Height', 'Weight', 'ReleaseClause', 'KitNumber',
       'BestOverallRating'],
      dtype='object')

In [33]:
# 공백 언더바
idx.str.replace(' ', '_')

Index(['ID', 'Name', 'Age', 'Photo', 'Nationality', 'Flag', 'Overall',
       'Potential', 'Club', 'Club_Logo', 'Value', 'Wage', 'Special',
       'Preferred_Foot', 'International_Reputation', 'Weak_Foot',
       'Skill_Moves', 'Work_Rate', 'Body_Type', 'Real_Face', 'Position',
       'Joined', 'Loaned_From', 'Contract_Valid_Until', 'Height', 'Weight',
       'Release_Clause', 'Kit_Number', 'Best_Overall_Rating'],
      dtype='object')

- `.str` 을 이용하면, 문자열을 편하게 쓸 수 있다.

## E. `s.astype()`

`-` 예시1: 원소의 타입을 모두 `int`형으로 변경

In [34]:
s = pd.Series(list('12345'))
s

0    1
1    2
2    3
3    4
4    5
dtype: object

In [36]:
int(s)

TypeError: cannot convert the series to <class 'int'>

In [35]:
s.astype(int) # 이게 더 좋은 방법..

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [38]:
s.apply(int) # 이렇게 해도 됨. (코드가 직관적이지 않음)

0    1
1    2
2    3
3    4
4    5
dtype: int64

`-` 예시2: 원소의 타입을 변환한 이후 브로드캐스팅 (int)

In [42]:
s1 = pd.Series(list('12345')) # object type
s2 = pd.Series([-1,-2,-3,-4,-5]) # int type

In [93]:
# s1 + s2 ## 에러

In [46]:
s1.astype(int)+s2

0    0
1    0
2    0
3    0
4    0
dtype: int64

`# 예시3`: 원소의 타입을 변환한 이후 브로드캐스팅 (str)

In [47]:
df = pd.read_csv("https://raw.githubusercontent.com/guebin/DV2023/main/posts/titanic.csv")[:5]
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,logFare
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,1.981001
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,4.266662
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,2.070022
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,3.972177
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,2.085672

위의 자료에서 `Embarked` 열과 `Pclass`열을 이용하여 아래와 같은
`New Feature`를 만들어라.

| Embarked | Pclass | New Feature |
|:--------:|:------:|:-----------:|
|   ‘S’    |   3    |    ‘S3’     |
|   ‘C’    |   1    |    ‘C1’     |
|   ‘S’    |   3    |    ‘S3’     |
|   ‘S’    |   1    |    ‘S1’     |
|   ‘S’    |   3    |    ‘S3’     |

(풀이)

In [53]:
# df.Embarked + df.Pclass ## 에러남

In [54]:
df.Embarked + df.Pclass.astype(str)

0    S3
1    C1
2    S3
3    S1
4    S3
dtype: object

`#`

## F. 컴프리헨션, `lambda+map`을 무시하지 말 것

`# 예시1`

In [55]:
df = pd.read_csv("https://raw.githubusercontent.com/guebin/DV2023/main/posts/titanic.csv")[:5]
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,logFare
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,1.981001
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,4.266662
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,2.070022
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,3.972177
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,2.085672

위의 자료에서 아래와 같은 변환을 하고 싶다면?

$$
f(\text{sex}, \text{sibsp}) = 
\begin{cases} 
0.7 + 0.25 \times \text{sibsp} & \text{if } \text{sex} = \text{'female'} \\
0.1 + 0.15 \times \text{sibsp} & \text{otherwise}
\end{cases}
$$

> **`map(입력이2개인 함수, 입력1의 리스트, 입력2의 리스트)`**

In [58]:
df.assign(Prob= list(map(lambda sex,sibsp: 0.7 + sibsp*0.25 if sex=='female' else 0.2 + sibsp*0.15, df.Sex, df.SibSp)))

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,logFare,Prob
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,1.981001,0.35
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,4.266662,0.95
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,2.070022,0.70
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,3.972177,0.95
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,2.085672,0.20

`# 예시2`

In [59]:
df = pd.read_csv("https://raw.githubusercontent.com/guebin/DV2023/main/posts/titanic.csv")[:5]
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,logFare
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,1.981001
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,4.266662
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,2.070022
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,3.972177
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,2.085672

위의 자료에서 Name열을 아래와 같이 분리하는 작업을 수행하라.

|     | title | Name                                          |
|-----|-------|-----------------------------------------------|
| 0   | Mr    | Owen Harris Braund                            |
| 1   | Mrs   | John Bradley (Florence Briggs Thayer) Cumings |
| 2   | Miss  | Laina Heikkinen                               |
| 3   | Mrs   | Jacques Heath (Lily May Peel) Futrelle        |
| 4   | Mr    | William Henry Allen                           |

In [60]:
df.Name

0                              Braund, Mr. Owen Harris
1    Cumings, Mrs. John Bradley (Florence Briggs Th...
2                               Heikkinen, Miss. Laina
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                             Allen, Mr. William Henry
Name: Name, dtype: object

In [72]:
[i for i in df.Name.str.replace(', ','/').str.replace('. ','/').str.split('/')]

[['Braund', 'Mr', 'Owen Harris'],
 ['Cumings', 'Mrs', 'John Bradley (Florence Briggs Thayer)'],
 ['Heikkinen', 'Miss', 'Laina'],
 ['Futrelle', 'Mrs', 'Jacques Heath (Lily May Peel)'],
 ['Allen', 'Mr', 'William Henry']]

In [74]:
[[last_name,title,first_name] for last_name,title,first_name in df.Name.str.replace(', ','/').str.replace('. ','/').str.split('/')]

[['Braund', 'Mr', 'Owen Harris'],
 ['Cumings', 'Mrs', 'John Bradley (Florence Briggs Thayer)'],
 ['Heikkinen', 'Miss', 'Laina'],
 ['Futrelle', 'Mrs', 'Jacques Heath (Lily May Peel)'],
 ['Allen', 'Mr', 'William Henry']]

In [77]:
# title, 이름+성
[[title,first_name+ ' ' + last_name] for last_name,title,first_name in df.Name.str.replace(', ','/').str.replace('. ','/').str.split('/')]

[['Mr', 'Owen Harris Braund'],
 ['Mrs', 'John Bradley (Florence Briggs Thayer) Cumings'],
 ['Miss', 'Laina Heikkinen'],
 ['Mrs', 'Jacques Heath (Lily May Peel) Futrelle'],
 ['Mr', 'William Henry Allen']]

In [79]:
# fstring 이용
[[title,f'{first_name} {last_name}'] for last_name,title,first_name in df.Name.str.replace(', ','/').str.replace('. ','/').str.split('/')]

[['Mr', 'Owen Harris Braund'],
 ['Mrs', 'John Bradley (Florence Briggs Thayer) Cumings'],
 ['Miss', 'Laina Heikkinen'],
 ['Mrs', 'Jacques Heath (Lily May Peel) Futrelle'],
 ['Mr', 'William Henry Allen']]

(풀이)

In [80]:
_lst = [[title,f'{first_name} {last_name}'] for last_name, title, first_name in df.Name.str.replace(', ','/').str.replace('. ','/').str.split('/')]
pd.DataFrame(_lst, columns=['title','Name2'])

  title                                          Name2
0    Mr                             Owen Harris Braund
1   Mrs  John Bradley (Florence Briggs Thayer) Cumings
2  Miss                                Laina Heikkinen
3   Mrs         Jacques Heath (Lily May Peel) Futrelle
4    Mr                            William Henry Allen

참고: “Mr,Mrs,Miss” 만 뽑아내는 코드 (대면수업에서 하려다가 실패한 코드)

In [86]:
df.Name.str.split(', ').str[-1].str.split('. ').str[0]

0      Mr
1     Mrs
2    Miss
3     Mrs
4      Mr
Name: Name, dtype: object

# 4. 숙제

아래와 같은 데이터프레임이 있다고 하자.

In [87]:
df = pd.DataFrame({'A':[1,2,3,4]})
df

   A
0  1
1  2
2  3
3  4

아래의 결과를 관찰하고 이러한 결과가 나오는 이유를 정리하여 제출하라.

In [88]:
df[['A']].apply(np.mean) # df[['A']]는 데이터프레임 (집계함수O)

A    2.5
dtype: float64

In [94]:
type(df[['A']]), type(df['A']) # df['A'] 판다스 시리즈 (집계함수X, 변환함수O)

(pandas.core.frame.DataFrame, pandas.core.series.Series)

In [89]:
df['A'].apply(np.mean)

0    1.0
1    2.0
2    3.0
3    4.0
Name: A, dtype: float64